jaszczurtd/JaszczurHAL/src/hal/impl/stm32g474/hal_i2c.cpp
#include "hal/core/hal_target.h"
#if HAL_TARGET_IS_STM32G474

#include "hal/core/hal_config.h"
#ifdef HAL_ENABLE_I2C

#include "hal/core/hal_mutex_once.h"
#include "hal/i2c/hal_i2c.h"
#include "hal/i2c/hal_i2c_internal.h"
#include "hal/system/hal_sync.h"
#include "hal/system/hal_system.h"

#include <string.h>

#if defined(HAL_ENABLE_FREERTOS)
#include <FreeRTOS.h>
#include <task.h>
#endif

#ifdef JH_STM32G474_HW
#include "port/stm32g474_i2c_pins.h"
#include "port/stm32g474_regs.h"
#endif

#define STM32_I2C_BUF_SIZE 255

typedef struct {
  uint8_t rx_buf[STM32_I2C_BUF_SIZE];
  int rx_len;
  int rx_pos;
  uint8_t tx_buf[STM32_I2C_BUF_SIZE];
  int tx_len;
  hal_i2c_address_t cur_addr;
#ifdef HAL_ENABLE_I2C_10BIT
  hal_i2c_addr_mode_t addr_mode;
#endif
  uint8_t last_error; /* result of the last end_transmission */
  bool initialized;
  uint32_t clock_hz;
  uint32_t transaction_count;
  uint32_t bus_clear_count;
  uint8_t sda_pin;
  uint8_t scl_pin;
  hal_mutex_t mutex;
  uintptr_t lock_owner;
  uint32_t lock_depth;
#ifdef JH_STM32G474_HW
  uint32_t hw_base;
  uint32_t hw_rcc_mask;
#endif
} i2c_bus_state_t;

static i2c_bus_state_t s_i2c[2] = {};

static inline bool i2c_bus_valid(uint8_t bus) { return bus <= 1u; }

static inline uint8_t i2c_bus_index(uint8_t bus) {
  HAL_ASSERT(bus <= 1u, "hal_i2c: invalid bus index");
  return (bus <= 1u) ? bus : 0u;
}

static inline i2c_bus_state_t *i2c_state(uint8_t bus) {
  return &s_i2c[i2c_bus_index(bus)];
}

bool jh_hal_i2c_bus_is_initialized(uint8_t bus) {
  return i2c_bus_valid(bus) && i2c_state(bus)->initialized;
}

#ifdef HAL_ENABLE_I2C_10BIT
bool jh_hal_i2c_bus_is_10bit(uint8_t bus) {
  return i2c_bus_valid(bus) &&
         i2c_state(bus)->addr_mode == HAL_I2C_ADDR_MODE_10BIT;
}

static inline bool i2c_state_is_10bit(const i2c_bus_state_t *st) {
  return st->addr_mode == HAL_I2C_ADDR_MODE_10BIT;
}
#else
static inline bool i2c_state_is_10bit(const i2c_bus_state_t *st) {
  (void)st;
  return false;
}
#endif

static void i2c_ensure_mutex(uint8_t bus) {
  i2c_bus_state_t *st = i2c_state(bus);
  (void)jh_hal_mutex_create_once(&st->mutex);
}

static uintptr_t i2c_current_owner_token(void) {
#if defined(HAL_ENABLE_FREERTOS)
  TaskHandle_t task = xTaskGetCurrentTaskHandle();
  return (task != NULL) ? (uintptr_t)task : 1u;
#else
  return 1u;
#endif
}

static void i2c_lock_state(i2c_bus_state_t *st) {
  const uintptr_t owner = i2c_current_owner_token();
  if ((st->lock_depth > 0u) && (st->lock_owner == owner)) {
    st->lock_depth++;
    return;
  }

  hal_mutex_lock(st->mutex);
  st->lock_owner = owner;
  st->lock_depth = 1u;
}

static void i2c_unlock_state(i2c_bus_state_t *st) {
  const uintptr_t owner = i2c_current_owner_token();
  HAL_ASSERT((st->lock_depth > 0u) && (st->lock_owner == owner),
             "hal_i2c_unlock: bus is not locked by this context");
  if ((st->lock_depth == 0u) || (st->lock_owner != owner)) {
    return;
  }

  st->lock_depth--;
  if (st->lock_depth == 0u) {
    st->lock_owner = 0u;
    hal_mutex_unlock(st->mutex);
  }
}

static void i2c_lock_bus(uint8_t bus) {
  i2c_ensure_mutex(bus);
  i2c_lock_state(i2c_state(bus));
}

static void i2c_unlock_bus(uint8_t bus) {
  i2c_ensure_mutex(bus);
  i2c_unlock_state(i2c_state(bus));
}

static hal_status_t i2c_status_from_result(uint8_t result) {
  switch (result) {
  case HAL_I2C_RESULT_OK:
    return HAL_OK;
  case HAL_I2C_ERROR_TIMEOUT:
    return HAL_ETIMEOUT;
  case HAL_I2C_ERROR_GENERIC:
    return HAL_EBUS;
  case HAL_I2C_ERROR_OTHER:
  default:
    return HAL_EIO;
  }
}

#ifdef JH_STM32G474_HW
#define I2C_TIMEOUT 200000u

/* Port-indexed pin id helper: pin = port*16 + pin_number. */
#define JH_STM32_PIN(port, pin) ((uint8_t)(((port) * 16u) + (pin)))

enum {
  I2C_CTRL_1 = 1u,
  I2C_CTRL_2 = 2u,
};

typedef struct {
  uint8_t controller;
  uint32_t base;
  uint32_t rcc_mask;
  uint8_t default_sda_pin;
  uint8_t default_scl_pin;
} i2c_hw_desc_t;

static const i2c_hw_desc_t k_i2c_hw_desc[2] = {
    {/* bus 0 */
     I2C_CTRL_1, I2C1_BASE, RCC_APB1ENR1_I2C1EN, JH_STM32_PIN(1u, 9u),
     JH_STM32_PIN(1u, 8u)},
    {/* bus 1 */
     I2C_CTRL_2, I2C2_BASE, RCC_APB1ENR1_I2C2EN, JH_STM32_PIN(0u, 8u),
     JH_STM32_PIN(0u, 9u)},
};

static inline const i2c_hw_desc_t *i2c_hw_desc_for_bus(uint8_t bus) {
  return &k_i2c_hw_desc[i2c_bus_index(bus)];
}

static inline uint32_t i2c_pin_port(uint8_t pin) {
  return jh_stm32g474_pin_port(pin);
}

static inline uint32_t i2c_pin_num(uint8_t pin) {
  return jh_stm32g474_pin_number(pin);
}

static inline bool i2c_pin_valid(uint8_t pin) {
  return i2c_pin_port(pin) <= 6u;
}

static bool i2c_pin_find_af(uint8_t controller, bool is_sda, uint8_t pin,
                            uint8_t *out_af) {
  return jh_stm32g474_i2c_find_af(controller, is_sda, pin, out_af);
}

static void i2c_gpio_enable_clock(uint32_t port) {
  if (port <= 6u) {
    RCC_AHB2ENR |= (1u << port);
    (void)RCC_AHB2ENR;
  }
}

static void i2c_gpio_set_af_od_pullup(uint8_t pin, uint8_t af) {
  jh_stm32g474_i2c_set_af_od_pullup(pin, af);
}

static void i2c_gpio_set_input_pullup(uint8_t pin) {
  const uint32_t port = i2c_pin_port(pin);
  const uint32_t n = i2c_pin_num(pin);
  if (port > 6u) {
    return;
  }

  i2c_gpio_enable_clock(port);
  GPIO_MODER(port) =
      (GPIO_MODER(port) & ~(0x3u << (n * 2u))) | (GPIO_MODE_INPUT << (n * 2u));
  GPIO_OTYPER(port) |= (1u << n);
  GPIO_PUPDR(port) =
      (GPIO_PUPDR(port) & ~(0x3u << (n * 2u))) | (GPIO_PUPD_UP << (n * 2u));
}

static void i2c_gpio_set_output_od_pullup(uint8_t pin) {
  const uint32_t port = i2c_pin_port(pin);
  const uint32_t n = i2c_pin_num(pin);
  if (port > 6u) {
    return;
  }

  i2c_gpio_enable_clock(port);
  GPIO_MODER(port) =
      (GPIO_MODER(port) & ~(0x3u << (n * 2u))) | (GPIO_MODE_OUTPUT << (n * 2u));
  GPIO_OTYPER(port) |= (1u << n);
  GPIO_OSPEEDR(port) |= (0x3u << (n * 2u));
  GPIO_PUPDR(port) =
      (GPIO_PUPDR(port) & ~(0x3u << (n * 2u))) | (GPIO_PUPD_UP << (n * 2u));
}

static void i2c_gpio_write(uint8_t pin, bool high) {
  const uint32_t port = i2c_pin_port(pin);
  const uint32_t n = i2c_pin_num(pin);
  if (port > 6u) {
    return;
  }
  GPIO_BSRR(port) = high ? (1u << n) : (1u << (n + 16u));
}

static bool i2c_gpio_read(uint8_t pin) {
  const uint32_t port = i2c_pin_port(pin);
  const uint32_t n = i2c_pin_num(pin);
  if (port > 6u) {
    return false;
  }
  return (GPIO_IDR(port) & (1u << n)) != 0u;
}

static void i2c_bus_clear_delay(void) { hal_delay_us(5u); }

static uint32_t i2c_timing_from_clock(uint32_t clock_hz) {
  if (clock_hz >= HAL_I2C_CLOCK_FAST_PLUS_HZ) {
    return I2C_TIMINGR_1M_16MHZ;
  }
  if (clock_hz >= HAL_I2C_CLOCK_FAST_HZ) {
    return I2C_TIMINGR_400K_16MHZ;
  }
  return I2C_TIMINGR_100K_16MHZ;
}

static void i2c_hw_apply_clock(uint32_t base, uint32_t clock_hz) {
  I2C_CR1_REG(base) &= ~I2C_CR1_PE;
  I2C_TIMINGR_REG(base) = i2c_timing_from_clock(clock_hz);
  I2C_CR1_REG(base) |= I2C_CR1_PE;
}

static bool i2c_hw_configure_bus(i2c_bus_state_t *st, const i2c_hw_desc_t *desc,
                                 uint8_t requested_sda_pin,
                                 uint8_t requested_scl_pin) {
  uint8_t sda_pin = requested_sda_pin;
  uint8_t scl_pin = requested_scl_pin;

  if (sda_pin == 0u) {
    sda_pin = desc->default_sda_pin;
  }
  if (scl_pin == 0u) {
    scl_pin = desc->default_scl_pin;
  }

  uint8_t sda_af = 0u;
  uint8_t scl_af = 0u;
  if (!i2c_pin_find_af(desc->controller, true, sda_pin, &sda_af) ||
      !i2c_pin_find_af(desc->controller, false, scl_pin, &scl_af)) {
    st->hw_base = 0u;
    st->hw_rcc_mask = 0u;
    return false;
  }

