jaszczurtd/JaszczurHAL/src/hal/impl/stm32g474/hal_i2c.cpp
  st->sda_pin = sda_pin;
  st->scl_pin = scl_pin;
  st->hw_base = desc->base;
  st->hw_rcc_mask = desc->rcc_mask;

  RCC_APB1ENR1 |= st->hw_rcc_mask;
  (void)RCC_APB1ENR1;
  jh_stm32g474_i2c_select_hsi16(desc->controller);

  i2c_gpio_set_af_od_pullup(st->scl_pin, scl_af);
  i2c_gpio_set_af_od_pullup(st->sda_pin, sda_af);
  i2c_hw_apply_clock(st->hw_base, st->clock_hz);
  return true;
}

static inline bool i2c_hw_ready(const i2c_bus_state_t *st) {
  return st->initialized && st->hw_base != 0u;
}

/* Assemble the CR2 address bits for @p addr in the given mode: (addr << 1)
 * with ADD10 clear for 7-bit, or the raw address in SADD[9:0] with ADD10 set
 * for 10-bit. HEAD10R is deliberately never set - see the comment on
 * I2C_CR2_HEAD10R in stm32g474_regs.h. */
static inline uint32_t i2c_cr2_addr_bits(hal_i2c_address_t addr,
                                         bool is_10bit) {
  return is_10bit ? (((uint32_t)addr & 0x3FFu) | I2C_CR2_ADD10)
                  : ((uint32_t)(uint8_t)addr << 1);
}

/* Master write of @p len bytes (AUTOEND). Returns HAL_I2C_* status. */
static uint8_t i2c_hw_write(uint32_t base, hal_i2c_address_t addr,
                            bool is_10bit, const uint8_t *buf, int len) {
  I2C_ICR_REG(base) = I2C_ICR_NACKCF | I2C_ICR_STOPCF;
  I2C_CR2_REG(base) = i2c_cr2_addr_bits(addr, is_10bit) |
                      ((uint32_t)(uint8_t)len << 16) | I2C_CR2_AUTOEND |
                      I2C_CR2_START;
  for (int i = 0; i < len; ++i) {
    uint32_t to = I2C_TIMEOUT;
    while (!(I2C_ISR_REG(base) & (I2C_ISR_TXIS | I2C_ISR_NACKF)) && to) {
      --to;
    }
    if (to == 0u) {
      return HAL_I2C_ERROR_TIMEOUT;
    }
    if (I2C_ISR_REG(base) & I2C_ISR_NACKF) {
      break;
    }
    I2C_TXDR_REG(base) = buf[i];
  }
  uint32_t to = I2C_TIMEOUT;
  while (!(I2C_ISR_REG(base) & I2C_ISR_STOPF) && to) {
    --to;
  }
  if (to == 0u) {
    return HAL_I2C_ERROR_TIMEOUT;
  }
  const bool nack = (I2C_ISR_REG(base) & I2C_ISR_NACKF) != 0u;
  I2C_ICR_REG(base) = I2C_ICR_STOPCF | I2C_ICR_NACKCF;
  return nack ? HAL_I2C_ERROR_GENERIC : HAL_I2C_RESULT_OK;
}

/* Master read of @p len bytes (AUTOEND). Returns number of bytes received. */
static int i2c_hw_read(uint32_t base, hal_i2c_address_t addr, bool is_10bit,
                       uint8_t *buf, int len) {
  if (len <= 0) {
    return 0;
  }
  I2C_ICR_REG(base) = I2C_ICR_NACKCF | I2C_ICR_STOPCF;
  I2C_CR2_REG(base) = i2c_cr2_addr_bits(addr, is_10bit) |
                      ((uint32_t)(uint8_t)len << 16) | I2C_CR2_RD_WRN |
                      I2C_CR2_AUTOEND | I2C_CR2_START;
  int got = 0;
  for (int i = 0; i < len; ++i) {
    uint32_t to = I2C_TIMEOUT;
    while (!(I2C_ISR_REG(base) & (I2C_ISR_RXNE | I2C_ISR_NACKF)) && to) {
      --to;
    }
    if (to == 0u || (I2C_ISR_REG(base) & I2C_ISR_NACKF)) {
      break;
    }
    buf[i] = (uint8_t)I2C_RXDR_REG(base);
    ++got;
  }
  uint32_t to = I2C_TIMEOUT;
  while (!(I2C_ISR_REG(base) & I2C_ISR_STOPF) && to) {
    --to;
  }
  I2C_ICR_REG(base) = I2C_ICR_STOPCF | I2C_ICR_NACKCF;
  return got;
}

static bool i2c_hw_write_read(uint32_t base, hal_i2c_address_t addr,
                              bool is_10bit, const uint8_t *tx, int tx_len,
                              uint8_t *rx, int rx_len) {
  if (tx_len <= 0 || rx_len < 0) {
    return false;
  }
  I2C_ICR_REG(base) = I2C_ICR_NACKCF | I2C_ICR_STOPCF;
  I2C_CR2_REG(base) = i2c_cr2_addr_bits(addr, is_10bit) |
                      ((uint32_t)(uint8_t)tx_len << 16) | I2C_CR2_START;
  for (int i = 0; i < tx_len; ++i) {
    uint32_t to = I2C_TIMEOUT;
    while (!(I2C_ISR_REG(base) & (I2C_ISR_TXIS | I2C_ISR_NACKF)) && to) {
      --to;
    }
    if (to == 0u || (I2C_ISR_REG(base) & I2C_ISR_NACKF)) {
      I2C_ICR_REG(base) = I2C_ICR_NACKCF | I2C_ICR_STOPCF;
      return false;
    }
    I2C_TXDR_REG(base) = tx[i];
  }

  uint32_t to = I2C_TIMEOUT;
  while (!(I2C_ISR_REG(base) & (I2C_ISR_TC | I2C_ISR_NACKF)) && to) {
    --to;
  }
  if (to == 0u || (I2C_ISR_REG(base) & I2C_ISR_NACKF)) {
    I2C_ICR_REG(base) = I2C_ICR_NACKCF | I2C_ICR_STOPCF;
    return false;
  }

  if (rx_len == 0) {
    I2C_CR2_REG(base) |= I2C_CR2_STOP;
    to = I2C_TIMEOUT;
    while (!(I2C_ISR_REG(base) & I2C_ISR_STOPF) && to) {
      --to;
    }
    I2C_ICR_REG(base) = I2C_ICR_STOPCF | I2C_ICR_NACKCF;
    return to != 0u;
  }

  I2C_CR2_REG(base) = i2c_cr2_addr_bits(addr, is_10bit) |
                      ((uint32_t)(uint8_t)rx_len << 16) | I2C_CR2_RD_WRN |
                      I2C_CR2_AUTOEND | I2C_CR2_START;
  int got = 0;
  for (int i = 0; i < rx_len; ++i) {
    to = I2C_TIMEOUT;
    while (!(I2C_ISR_REG(base) & (I2C_ISR_RXNE | I2C_ISR_NACKF)) && to) {
      --to;
    }
    if (to == 0u || (I2C_ISR_REG(base) & I2C_ISR_NACKF)) {
      break;
    }
    rx[i] = (uint8_t)I2C_RXDR_REG(base);
    ++got;
  }

  to = I2C_TIMEOUT;
  while (!(I2C_ISR_REG(base) & I2C_ISR_STOPF) && to) {
    --to;
  }
  I2C_ICR_REG(base) = I2C_ICR_STOPCF | I2C_ICR_NACKCF;
  return (to != 0u) && (got == rx_len);
}

/* Zero-byte probe: returns true if the device ACKs (is present). */
static bool i2c_hw_ack(uint32_t base, hal_i2c_address_t addr, bool is_10bit) {
  I2C_ICR_REG(base) = I2C_ICR_NACKCF | I2C_ICR_STOPCF;
  I2C_CR2_REG(base) =
      i2c_cr2_addr_bits(addr, is_10bit) | I2C_CR2_AUTOEND | I2C_CR2_START;
  uint32_t to = I2C_TIMEOUT;
  while (!(I2C_ISR_REG(base) & I2C_ISR_STOPF) && to) {
    --to;
  }
  const bool nack = (I2C_ISR_REG(base) & I2C_ISR_NACKF) != 0u;
  I2C_ICR_REG(base) = I2C_ICR_STOPCF | I2C_ICR_NACKCF;
  return (to != 0u) && !nack;
}
#endif /* JH_STM32G474_HW */

static hal_status_t stm32_i2c_init_bus_common(uint8_t bus, uint8_t sda_pin,
                                              uint8_t scl_pin,
                                              uint32_t clock_hz) {
  if (!i2c_bus_valid(bus)) {
    return HAL_EINVAL;
  }
  i2c_ensure_mutex(bus);

  i2c_bus_state_t *st = i2c_state(bus);
  st->rx_len = 0;
  st->rx_pos = 0;
  st->tx_len = 0;
  st->cur_addr = 0u;
  st->last_error = 0u;
  st->clock_hz = (clock_hz == 0u) ? HAL_I2C_CLOCK_STANDARD_HZ : clock_hz;
  st->transaction_count = 0u;
  st->bus_clear_count = 0u;
  st->sda_pin = sda_pin;
  st->scl_pin = scl_pin;
  if (st->lock_depth == 0u) {
    st->lock_owner = 0u;
  }
#ifdef JH_STM32G474_HW
  st->hw_base = 0u;
  st->hw_rcc_mask = 0u;

  const i2c_hw_desc_t *desc = i2c_hw_desc_for_bus(bus);
  if (!i2c_hw_configure_bus(st, desc, sda_pin, scl_pin)) {
    st->initialized = false;
    return HAL_ECONFIG;
  }
#endif
  st->initialized = true;
  return HAL_OK;
}

hal_status_t hal_i2c_init(uint8_t sda_pin, uint8_t scl_pin, uint32_t clock_hz) {
  return hal_i2c_init_bus(0, sda_pin, scl_pin, clock_hz);
}

hal_status_t hal_i2c_init_bus(uint8_t bus, uint8_t sda_pin, uint8_t scl_pin,
                              uint32_t clock_hz) {
  const hal_status_t status =
      stm32_i2c_init_bus_common(bus, sda_pin, scl_pin, clock_hz);
#ifdef HAL_ENABLE_I2C_10BIT
  if (status == HAL_OK) {
    i2c_state(bus)->addr_mode = HAL_I2C_ADDR_MODE_7BIT;
  }
#endif
  return status;
}

#ifdef HAL_ENABLE_I2C_10BIT
hal_status_t hal_i2c_init_10bit(uint8_t sda_pin, uint8_t scl_pin,
                                uint32_t clock_hz) {
  return hal_i2c_init_bus_10bit(0, sda_pin, scl_pin, clock_hz);
}

hal_status_t hal_i2c_init_bus_10bit(uint8_t bus, uint8_t sda_pin,
                                    uint8_t scl_pin, uint32_t clock_hz) {
  const hal_status_t status =
      stm32_i2c_init_bus_common(bus, sda_pin, scl_pin, clock_hz);
  if (status == HAL_OK) {
    i2c_state(bus)->addr_mode = HAL_I2C_ADDR_MODE_10BIT;
  }
  return status;
}

hal_i2c_addr_mode_t hal_i2c_get_addr_mode(void) {
  return hal_i2c_get_addr_mode_bus(0);
}

hal_i2c_addr_mode_t hal_i2c_get_addr_mode_bus(uint8_t bus) {
  return i2c_state(bus)->addr_mode;
}
#endif /* HAL_ENABLE_I2C_10BIT */

hal_status_t hal_i2c_get_clock(uint32_t *out_clock_hz) {
  return hal_i2c_get_clock_bus(0, out_clock_hz);
}

hal_status_t hal_i2c_get_clock_bus(uint8_t bus, uint32_t *out_clock_hz) {
  if (!i2c_bus_valid(bus) || out_clock_hz == NULL) {
    return HAL_EINVAL;
  }
  *out_clock_hz = i2c_state(bus)->clock_hz;
  return HAL_OK;
}

hal_status_t hal_i2c_set_clock(uint32_t clock_hz) {
  return hal_i2c_set_clock_bus(0, clock_hz);
}

