jaszczurtd/JaszczurHAL/src/hal/impl/stm32g474/hal_i2c.cpp
hal_status_t hal_i2c_set_clock_bus(uint8_t bus, uint32_t clock_hz) {
  if (!i2c_bus_valid(bus)) {
    return HAL_EINVAL;
  }
  i2c_ensure_mutex(bus);
  i2c_bus_state_t *st = i2c_state(bus);
  i2c_lock_state(st);
  st->clock_hz = (clock_hz == 0u) ? HAL_I2C_CLOCK_STANDARD_HZ : clock_hz;
#ifdef JH_STM32G474_HW
  if (i2c_hw_ready(st)) {
    i2c_hw_apply_clock(st->hw_base, st->clock_hz);
  }
#endif
  i2c_unlock_state(st);
  return HAL_OK;
}

void hal_i2c_deinit(void) { hal_i2c_deinit_bus(0); }

void hal_i2c_deinit_bus(uint8_t bus) {
  i2c_bus_state_t *st = i2c_state(bus);
  st->initialized = false;
  st->rx_len = 0;
  st->rx_pos = 0;
  st->tx_len = 0;
  st->cur_addr = 0u;
#ifdef JH_STM32G474_HW
  if (st->hw_base != 0u) {
    I2C_CR1_REG(st->hw_base) &= ~I2C_CR1_PE;
  }
  st->hw_base = 0u;
  st->hw_rcc_mask = 0u;
#endif
}

void hal_i2c_lock(void) { hal_i2c_lock_bus(0); }

void hal_i2c_lock_bus(uint8_t bus) { i2c_lock_bus(bus); }

void hal_i2c_unlock(void) { hal_i2c_unlock_bus(0); }

void hal_i2c_unlock_bus(uint8_t bus) { i2c_unlock_bus(bus); }

void hal_i2c_begin_transmission(hal_i2c_address_t address) {
  hal_i2c_begin_transmission_bus(0, address);
}

void hal_i2c_begin_transmission_bus(uint8_t bus, hal_i2c_address_t address) {
  i2c_lock_bus(bus);
  i2c_state(bus)->cur_addr = address;
  i2c_state(bus)->tx_len = 0;
}

size_t hal_i2c_write(uint8_t data) { return hal_i2c_write_bus(0, data); }

size_t hal_i2c_write_bus(uint8_t bus, uint8_t data) {
  i2c_bus_state_t *st = i2c_state(bus);
  if (st->tx_len >= STM32_I2C_BUF_SIZE) {
    return 0u;
  }
  st->tx_buf[st->tx_len++] = data;
  return 1u;
}

hal_status_t hal_i2c_end_transmission_ex(void) {
  return hal_i2c_end_transmission_bus_ex(0);
}

hal_status_t hal_i2c_end_transmission_bus_ex(uint8_t bus) {
  if (!i2c_bus_valid(bus)) {
    return HAL_EINVAL;
  }
  i2c_bus_state_t *st = i2c_state(bus);
  if (hal_status_is_error(jh_hal_i2c_validate_address(bus, st->cur_addr))) {
    st->tx_len = 0;
    i2c_unlock_bus(bus);
    return HAL_EINVAL;
  }
  uint8_t err = HAL_I2C_RESULT_OK;
#ifdef JH_STM32G474_HW
  if (i2c_hw_ready(st)) {
    err = i2c_hw_write(st->hw_base, st->cur_addr, i2c_state_is_10bit(st),
                       st->tx_buf, st->tx_len);
  } else {
    err = HAL_I2C_ERROR_TIMEOUT;
  }
#endif
  st->last_error = err;
  st->tx_len = 0;
  st->transaction_count++;
  i2c_unlock_bus(bus);
  return i2c_status_from_result(err);
}

static bool i2c_write_read_bus_impl(uint8_t bus, hal_i2c_address_t address,
                                    const uint8_t *tx, size_t tx_len,
                                    uint8_t *rx, size_t rx_len);

hal_status_t hal_i2c_write_read_bus_ex(uint8_t bus, hal_i2c_address_t address,
                                       const uint8_t *tx, size_t tx_len,
                                       uint8_t *rx, size_t rx_len) {
  if (!i2c_bus_valid(bus) || (tx_len > 0u && tx == NULL) ||
      (rx_len > 0u && rx == NULL) || tx_len > STM32_I2C_BUF_SIZE ||
      rx_len > STM32_I2C_BUF_SIZE) {
    return HAL_EINVAL;
  }
  if (hal_status_is_error(jh_hal_i2c_validate_address(bus, address))) {
    return HAL_EINVAL;
  }
  if (tx_len == 0u) {
    return hal_i2c_read_bytes_bus_ex(bus, address, rx, rx_len);
  }
  if (!i2c_state(bus)->initialized) {
    HAL_ASSERT(false, "hal_i2c: bus used before hal_i2c_init_bus");
    return HAL_EUNINIT;
  }
  return hal_status_from_bool(
      i2c_write_read_bus_impl(bus, address, tx, tx_len, rx, rx_len), HAL_EBUS);
}

static bool i2c_write_read_bus_impl(uint8_t bus, hal_i2c_address_t address,
                                    const uint8_t *tx, size_t tx_len,
                                    uint8_t *rx, size_t rx_len) {
  if ((tx_len > 0u && tx == NULL) || (rx_len > 0u && rx == NULL) ||
      tx_len > 255u || rx_len > 255u) {
    return false;
  }

  i2c_bus_state_t *st = i2c_state(bus);
  i2c_lock_bus(bus);
  bool ok = true;
#ifdef JH_STM32G474_HW
  if (!i2c_hw_ready(st)) {
    i2c_unlock_bus(bus);
    return false;
  }

  ok = i2c_hw_write_read(st->hw_base, address, i2c_state_is_10bit(st), tx,
                         (int)tx_len, rx, (int)rx_len);
  st->transaction_count += (rx_len > 0u) ? 2u : 1u;
  i2c_unlock_bus(bus);
  return ok;
#endif

  st->cur_addr = address;
  st->tx_len = 0;
  for (size_t i = 0; i < tx_len; ++i) {
    if (st->tx_len >= STM32_I2C_BUF_SIZE) {
      ok = false;
      break;
    }
    st->tx_buf[st->tx_len++] = tx[i];
  }
  st->tx_len = 0;
  st->transaction_count++;

  if (ok && rx_len > 0u) {
    st->rx_len = (int)rx_len;
    st->rx_pos = 0;
    for (size_t i = 0; i < rx_len; ++i) {
      int v = hal_i2c_read_bus(bus);
      if (v < 0) {
        ok = false;
        break;
      }
      rx[i] = (uint8_t)v;
    }
    st->transaction_count++;
  }

  i2c_unlock_bus(bus);
  return ok;
}

static bool i2c_read_bytes_bus_impl(uint8_t bus, hal_i2c_address_t address,
                                    uint8_t *rx, size_t rx_len);

hal_status_t hal_i2c_read_bytes_bus_ex(uint8_t bus, hal_i2c_address_t address,
                                       uint8_t *rx, size_t rx_len) {
  if (!i2c_bus_valid(bus) || (rx_len > 0u && rx == NULL) ||
      rx_len > STM32_I2C_BUF_SIZE) {
    return HAL_EINVAL;
  }
  if (hal_status_is_error(jh_hal_i2c_validate_address(bus, address))) {
    return HAL_EINVAL;
  }
  if (rx_len == 0u) {
    return HAL_OK;
  }
  if (!i2c_state(bus)->initialized) {
    HAL_ASSERT(false, "hal_i2c: bus used before hal_i2c_init_bus");
    return HAL_EUNINIT;
  }
  return hal_status_from_bool(i2c_read_bytes_bus_impl(bus, address, rx, rx_len),
                              HAL_EBUS);
}

static bool i2c_read_bytes_bus_impl(uint8_t bus, hal_i2c_address_t address,
                                    uint8_t *rx, size_t rx_len) {
  if ((rx_len > 0u && rx == NULL) || rx_len > 255u) {
    return false;
  }
  if (rx_len == 0u) {
    return true;
  }

  i2c_bus_state_t *st = i2c_state(bus);
  i2c_lock_bus(bus);
  bool ok = true;
#ifdef JH_STM32G474_HW
  if (!i2c_hw_ready(st)) {
    i2c_unlock_bus(bus);
    return false;
  }

  int got = i2c_hw_read(st->hw_base, address, i2c_state_is_10bit(st), rx,
                        (int)rx_len);
  st->rx_len = 0;
  st->rx_pos = 0;
  st->transaction_count++;
  i2c_unlock_bus(bus);
  return got == (int)rx_len;
#else
  (void)address;
  memset(rx, 0, rx_len);
  st->rx_len = 0;
  st->rx_pos = 0;
  st->transaction_count++;
#endif
  i2c_unlock_bus(bus);
  return ok;
}

static uint8_t i2c_request_from_bus_impl(uint8_t bus, hal_i2c_address_t address,
                                         uint8_t count);

hal_status_t hal_i2c_request_from_bus_ex(uint8_t bus, hal_i2c_address_t address,
                                         uint8_t count, uint8_t *outReceived) {
  if (outReceived == NULL || !i2c_bus_valid(bus)) {
    return HAL_EINVAL;
  }
  *outReceived = 0u;
  if (hal_status_is_error(jh_hal_i2c_validate_address(bus, address))) {
    return HAL_EINVAL;
  }
  if (!i2c_state(bus)->initialized && count > 0u) {
    HAL_ASSERT(false, "hal_i2c: bus used before hal_i2c_init_bus");
    return HAL_EUNINIT;
  }
  *outReceived = i2c_request_from_bus_impl(bus, address, count);
  return (*outReceived == count) ? HAL_OK : HAL_EBUS;
}

static uint8_t i2c_request_from_bus_impl(uint8_t bus, hal_i2c_address_t address,
                                         uint8_t count) {
  i2c_bus_state_t *st = i2c_state(bus);

  i2c_lock_bus(bus);
  /* count is uint8_t (<=255) and the rx buffer holds 255 bytes, so it always
   * fits. */
  int got = 0;
#ifdef JH_STM32G474_HW
  if (i2c_hw_ready(st)) {
    got = i2c_hw_read(st->hw_base, address, i2c_state_is_10bit(st), st->rx_buf,
                      (int)count);
  } else {
    got = 0;
  }
#else
  (void)address;
  got = (int)count;
#endif
  st->rx_len = got;
  st->rx_pos = 0;
  st->transaction_count++;
  i2c_unlock_bus(bus);
  return (uint8_t)got;
}

int hal_i2c_available(void) { return hal_i2c_available_bus(0); }

int hal_i2c_available_bus(uint8_t bus) {
  i2c_bus_state_t *st = i2c_state(bus);
  return st->rx_len - st->rx_pos;
}

int hal_i2c_read(void) { return hal_i2c_read_bus(0); }

int hal_i2c_read_bus(uint8_t bus) {
  i2c_bus_state_t *st = i2c_state(bus);
  if (st->rx_pos < st->rx_len) {
    return st->rx_buf[st->rx_pos++];
  }
  return -1;
}

bool hal_i2c_is_busy(hal_i2c_address_t address) {
  return hal_i2c_is_busy_bus(0, address);
}

