jaszczurtd/JaszczurHAL/src/hal/impl/stm32g474/hal_i2c.cpp
bool hal_i2c_is_busy_bus(uint8_t bus, hal_i2c_address_t address) {
  if (hal_status_is_error(jh_hal_i2c_validate_address(bus, address))) {
    return true;
  }
#ifdef JH_STM32G474_HW
  i2c_bus_state_t *st = i2c_state(bus);
  if (i2c_hw_ready(st)) {
    i2c_lock_bus(bus);
    bool ack = i2c_hw_ack(st->hw_base, address, i2c_state_is_10bit(st));
    i2c_unlock_bus(bus);
    return !ack; /* busy/absent == did NOT ACK */
  }
  return true;
#endif
  (void)bus;
  (void)address;
  return false;
}

uint32_t hal_i2c_get_transaction_count(void) {
  return hal_i2c_get_transaction_count_bus(0);
}

uint32_t hal_i2c_get_transaction_count_bus(uint8_t bus) {
  return i2c_state(bus)->transaction_count;
}

hal_status_t hal_i2c_bus_clear(uint8_t sda_pin, uint8_t scl_pin) {
  return hal_i2c_bus_clear_bus(0, sda_pin, scl_pin);
}

static void i2c_bus_clear_bus_impl(uint8_t bus, uint8_t sda_pin,
                                   uint8_t scl_pin);

#ifdef JH_STM32G474_HW
static bool i2c_resolve_clear_pins(uint8_t bus, uint8_t sda_pin,
                                   uint8_t scl_pin, uint8_t *out_sda,
                                   uint8_t *out_scl) {
  const i2c_bus_state_t *st = i2c_state(bus);
  const i2c_hw_desc_t *desc = i2c_hw_desc_for_bus(bus);
  *out_sda = sda_pin != 0u
                 ? sda_pin
                 : (st->sda_pin != 0u ? st->sda_pin : desc->default_sda_pin);
  *out_scl = scl_pin != 0u
                 ? scl_pin
                 : (st->scl_pin != 0u ? st->scl_pin : desc->default_scl_pin);
  return i2c_pin_valid(*out_sda) && i2c_pin_valid(*out_scl);
}
#endif

hal_status_t hal_i2c_bus_clear_bus(uint8_t bus, uint8_t sda_pin,
                                   uint8_t scl_pin) {
  if (!i2c_bus_valid(bus)) {
    return HAL_EINVAL;
  }
#ifdef JH_STM32G474_HW
  uint8_t clear_sda = 0u;
  uint8_t clear_scl = 0u;
  if (!i2c_resolve_clear_pins(bus, sda_pin, scl_pin, &clear_sda, &clear_scl)) {
    return HAL_EINVAL;
  }
#endif
  i2c_bus_clear_bus_impl(bus, sda_pin, scl_pin);
  return HAL_OK;
}

static void i2c_bus_clear_bus_impl(uint8_t bus, uint8_t sda_pin,
                                   uint8_t scl_pin) {
#ifdef JH_STM32G474_HW
  uint8_t clear_sda = 0u;
  uint8_t clear_scl = 0u;
  if (!i2c_resolve_clear_pins(bus, sda_pin, scl_pin, &clear_sda, &clear_scl)) {
    HAL_ASSERT(false, "hal_i2c_bus_clear_bus: invalid pin id");
    i2c_state(bus)->bus_clear_count++;
    return;
  }

  i2c_gpio_set_input_pullup(clear_sda);
  i2c_gpio_set_output_od_pullup(clear_scl);
  i2c_gpio_write(clear_scl, true);
  i2c_bus_clear_delay();

  for (uint8_t i = 0u; i < 9u; ++i) {
    if (i2c_gpio_read(clear_sda)) {
      break;
    }
    i2c_gpio_write(clear_scl, false);
    i2c_bus_clear_delay();
    i2c_gpio_write(clear_scl, true);
    i2c_bus_clear_delay();
  }

  i2c_gpio_set_output_od_pullup(clear_sda);
  i2c_gpio_write(clear_sda, false);
  i2c_bus_clear_delay();
  i2c_gpio_write(clear_scl, true);
  i2c_bus_clear_delay();
  i2c_gpio_write(clear_sda, true);
  i2c_bus_clear_delay();

  i2c_gpio_set_input_pullup(clear_sda);
  i2c_gpio_set_input_pullup(clear_scl);
#else
  (void)sda_pin;
  (void)scl_pin;
#endif

  i2c_state(bus)->bus_clear_count++;
}

#endif /* HAL_ENABLE_I2C */

#endif // HAL_TARGET_IS_STM32G474
